[
  {
    "title": "Getting Back Into Coding After a Long Break",
    "slug": "2026-01-21-getting-back-into-coding-after-a-long-break",
    "date": "2026-01-21",
    "category": "Personal",
    "tags": ["motivation", "productivity", "career", "javascript", "haskell"],
    "image": "/images/2026-01-21-getting-back-into-coding-after-a-break.jpg",
    "readTime": "7 min",
    "summary": "After almost a year away from serious coding, here's what worked (and what didn't) when I decided to jump back in — tools, routines, mindset shifts, and why small public prototypes beat perfect private plans.",
    "content": "# Getting Back Into Coding After a Long Break\n\nIt's 2026 and my last meaningful commit was mid-2025. Life happened — work, family, burnout, side quests. Sound familiar?\n\nAfter almost a year away from serious coding, I've learned that getting back into it isn't about motivation or guilt. It's about creating the right conditions to rebuild momentum, one small win at a time.\n\n## What actually helped me return\n\n### 1. Tiny Public Prototypes (Like Vastreach)\n\nInstead of planning the perfect project, I shipped small things immediately. A little tool, a tiny library, a quick automation script. The key was making them public — pushing to GitHub, sharing with friends, getting feedback.\n\nThis worked because:\n- **Low stakes**: Nobody expects perfection from a weekend project\n- **Quick wins**: You finish something in hours or days, not months\n- **Accountability**: Public means you're more likely to follow through\n- **Resume building**: You have tangible work to show\n\n### 2. One Language Per Day Rule\n\nInstead of jumping between 5 languages and feeling scattered, I committed to a pattern:\n- **Monday–Wednesday**: JavaScript/TypeScript\n- **Thursday–Friday**: Haskell/Functional Programming\n- **Weekends**: Whatever feels interesting\n\nThis focused my learning curve and prevented context-switching fatigue. You get deeper with fewer contexts.\n\n### 3. No Zero Days — Even 15 Minutes Counts\n\nThe hardest part of returning is consistency. I made a rule: I had to code every single day, but there was no minimum. Some days it was 30 seconds to make a GitHub commit. Some days it was 8 hours of flow state.\n\nThe magic isn't in hours logged — it's in never breaking the chain. Missing a day makes day two easier to miss.\n\n## The Mindset Shift\n\nThe biggest blocker isn't lack of skill. It's perfectionism mixed with imposter syndrome. You think:\n- \"My code will be rusty\"\n- \"I've forgotten so much\"\n- \"I should start with a proper project\"\n\nAll lies. You haven't forgotten as much as you think. Your skills are dormant, not gone. Push ugly code. Commit unpolished work. The momentum builds faster than you think.\n\n## What didn't work\n\n- **Waiting for the perfect project idea**: You'll wait forever\n- **Online courses without projects**: All theory, no muscle memory\n- **All-or-nothing schedules**: 2-hour daily commitments are nice but not required\n- **Comparing yourself to who you were**: You've grown in other ways; you're not the same person\n\n## If you're in the same boat\n\nStart stupidly small. Commit something today. It can be:\n- A \"hello world\" in a language you've never tried\n- A fix for a bug that's been bugging you\n- A script that solves a small problem\n- Even just cloning a repo and exploring the code\n\nThen do it again tomorrow. The momentum builds faster than you think, and one month from now, you'll look back at what you've created and be surprised."
  }
]
